Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
      spi_host_device_t host = config->proto.spi.host;
      ESP_RETURN_ON_FALSE(host >= 0 && host < SPI_HOST_MAX,
                          ESP_ERR_INVALID_ARG,
                          s_TAG,
                          "Invalid SPI host number: %d",
                          host);

      /* Check if this is peripheral or controller mode */
      if (config->proto.spi.is_peripheral) {
        /* SPI Peripheral Mode */
        ESP_LOGI(s_TAG, "Initializing SPI peripheral '%s' (Host %d)", bus_name, host);

        spi_slave_interface_config_t slave_cfg = {
          .spics_io_num  = config->proto.spi.cs_io_num,
          .flags         = 0,
          .queue_size    = config->proto.spi.queue_size,
          .mode          = config->proto.spi.mode,
          .post_setup_cb = NULL,
          .post_trans_cb = NULL,
        };

        /* Map COPI/CIPO to ESP-IDF's MOSI/MISO */
        spi_bus_config_t bus_cfg = {
          .mosi_io_num     = config->proto.spi.copi_io_num,
          .miso_io_num     = config->proto.spi.cipo_io_num,
          .sclk_io_num     = config->proto.spi.sclk_io_num,
          .quadwp_io_num   = -1,
          .quadhd_io_num   = -1,
          .max_transfer_sz = 0,
        };

        ret = spi_slave_initialize(host, &bus_cfg, &slave_cfg, SPI_DMA_CH_AUTO);
        ESP_GOTO_ON_ERROR(ret,
                          fail,
                          s_TAG,
                          "spi_slave_initialize failed for '%s': %s",
                          bus_name,
                          esp_err_to_name(ret));

        manager->spi_host_initialized[host] = true;
        ESP_LOGI(s_TAG, "SPI peripheral '%s' initialized successfully", bus_name);
      } else {
        /* SPI Controller Mode */
        ESP_LOGI(s_TAG, "Initializing SPI device '%s' (Host %d)", bus_name, host);

        /* Initialize the SPI bus *only if* it hasn't been initialized yet for this host */
        if (!manager->spi_host_initialized[host]) {
          ESP_LOGI(s_TAG, "Initializing SPI bus driver for host %d...", host);
          /* Map COPI/CIPO to ESP-IDF's MOSI/MISO */
          spi_bus_config_t esp_idf_bus_cfg = {
            .mosi_io_num     = config->proto.spi.copi_io_num,
            .miso_io_num     = config->proto.spi.cipo_io_num,
            .sclk_io_num     = config->proto.spi.sclk_io_num,
            .quadwp_io_num   = config->proto.spi.quadwp_io_num,
            .quadhd_io_num   = config->proto.spi.quadhd_io_num,
            .max_transfer_sz = config->proto.spi.max_transfer_sz,
            .flags           = config->proto.spi.bus_cfg.flags,
          };
          int32_t dma_chan = (config->proto.spi.bus_cfg.flags & SPICOMMON_BUSFLAG_MASTER)
                               ? SPI_DMA_CH_AUTO
                               : SPI_DMA_DISABLED;
          ret              = spi_bus_initialize(host, &esp_idf_bus_cfg, dma_chan);
          ESP_GOTO_ON_ERROR(ret,
                            fail,
                            s_TAG,
                            "spi_bus_initialize failed for host %d: %s",
                            host,
                            esp_err_to_name(ret));
          manager->spi_host_initialized[host] = true;
          manager->spi_device_count[host]     = 0;
          ESP_LOGI(s_TAG, "SPI bus driver for host %d initialized.", host);
        } else {
          ESP_LOGD(s_TAG, "SPI bus driver for host %d already initialized.", host);
        }

        /* Add the SPI device to the bus */
        spi_device_handle_t spi_handle;
        ret = spi_bus_add_device(host, &config->proto.spi.dev_cfg, &spi_handle);
        ESP_GOTO_ON_ERROR(ret,
                          fail_spi_add_device,
                          s_TAG,
                          "spi_bus_add_device failed for '%s': %s",
                          bus_name,
                          esp_err_to_name(ret));
        config->handle = (void*)spi_handle;
        manager->spi_device_count[host]++;
      }
      break;

    case k_star_bus_type_gpio: {
      /* Initialize GPIO pins */
      ESP_LOGI(s_TAG, "Initializing GPIO bus '%s' with %d pins", bus_name, config->proto.gpio.pin_count);

      for (uint8_t i = 0; i < config->proto.gpio.pin_count; i++) {
        gpio_num_t pin = config->proto.gpio.pins[i];

        /* Configure each pin as output with default low level */
        gpio_config_t io_conf = {
          .pin_bit_mask = (1ULL << pin),
          .mode         = GPIO_MODE_INPUT_OUTPUT, /* Allow both input and output */
          .pull_up_en   = GPIO_PULLUP_DISABLE,
          .pull_down_en = GPIO_PULLDOWN_DISABLE,
          .intr_type    = GPIO_INTR_DISABLE,
        };

        ret = gpio_config(&io_conf);
        ESP_GOTO_ON_ERROR(ret,
                          fail,
                          s_TAG,
                          "gpio_config failed for pin %d: %s",
                          pin,
                          esp_err_to_name(ret));
      }

      ESP_LOGI(s_TAG, "GPIO bus '%s' initialized successfully", bus_name);
      break;
    }

    case k_star_bus_type_adc: {
      /* Initialize ADC unit */
      ESP_RETURN_ON_FALSE(manager,
                          ESP_ERR_INVALID_ARG,
                          s_TAG,
                          "Bus manager pointer is required for ADC initialization");

      adc_unit_t unit = config->proto.adc.unit;
      ESP_LOGI(s_TAG,
               "Initializing ADC bus '%s' (Unit: %d, Channel: %d)",
               bus_name,
               unit,
               config->proto.adc.channel);

      /* Check if ADC unit is already initialized (shared across channels) */
      if (manager->adc_unit_handles[unit] == NULL) {
        /* First channel on this unit - create the unit handle */
        ESP_LOGI(s_TAG, "Creating new ADC unit handle for unit %d", unit);

        adc_oneshot_unit_init_cfg_t unit_cfg = {
          .unit_id  = unit,
          .ulp_mode = ADC_ULP_MODE_DISABLE,
        };

        ret = adc_oneshot_new_unit(&unit_cfg, &manager->adc_unit_handles[unit]);
        ESP_GOTO_ON_ERROR(ret,
                          fail,
                          s_TAG,
                          "adc_oneshot_new_unit failed for '%s': %s",
                          bus_name,
                          esp_err_to_name(ret));
      } else {
        /* Unit already initialized - reuse the handle */
        ESP_LOGI(s_TAG, "Reusing existing ADC unit handle for unit %d", unit);
      }

      /* Store the shared unit handle in this config */
      config->proto.adc.unit_handle = manager->adc_unit_handles[unit];

