Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
      /* Configure this specific ADC channel */
      adc_oneshot_chan_cfg_t chan_cfg = {
        .bitwidth = config->proto.adc.bitwidth,
        .atten    = config->proto.adc.atten,
      };

      ret = adc_oneshot_config_channel(config->proto.adc.unit_handle,
                                        config->proto.adc.channel,
                                        &chan_cfg);
      ESP_GOTO_ON_ERROR(ret,
                        fail_adc_unit,
                        s_TAG,
                        "adc_oneshot_config_channel failed for '%s': %s",
                        bus_name,
                        esp_err_to_name(ret));

      /* Increment channel count for this unit */
      manager->adc_channel_count[unit]++;

      /* Try to initialize calibration (optional, may fail on some chips) */
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
      adc_cali_curve_fitting_config_t cali_cfg = {
        .unit_id  = unit,
        .chan     = config->proto.adc.channel,
        .atten    = config->proto.adc.atten,
        .bitwidth = config->proto.adc.bitwidth,
      };

      ret = adc_cali_create_scheme_curve_fitting(&cali_cfg, &config->proto.adc.cali_handle);
      if (ret == ESP_OK) {
        ESP_LOGI(s_TAG, "ADC calibration (curve fitting) initialized for '%s'", bus_name);
      } else {
        ESP_LOGW(s_TAG,
                 "ADC calibration initialization failed for '%s': %s (continuing without "
                 "calibration)",
                 bus_name,
                 esp_err_to_name(ret));
        config->proto.adc.cali_handle = NULL;
      }
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
      adc_cali_line_fitting_config_t cali_cfg = {
        .unit_id  = unit,
        .atten    = config->proto.adc.atten,
        .bitwidth = config->proto.adc.bitwidth,
      };

      ret = adc_cali_create_scheme_line_fitting(&cali_cfg, &config->proto.adc.cali_handle);
      if (ret == ESP_OK) {
        ESP_LOGI(s_TAG, "ADC calibration (line fitting) initialized for '%s'", bus_name);
      } else {
        ESP_LOGW(s_TAG,
                 "ADC calibration initialization failed for '%s': %s (continuing without "
                 "calibration)",
                 bus_name,
                 esp_err_to_name(ret));
        config->proto.adc.cali_handle = NULL;
      }
#else
      ESP_LOGW(s_TAG, "ADC calibration not supported on this chip, continuing without calibration");
      config->proto.adc.cali_handle = NULL;
#endif

      ESP_LOGI(s_TAG, "ADC bus '%s' initialized successfully", bus_name);
      break;

    fail_adc_unit:
      /* Only delete the unit if we created it (first channel on this unit) */
      manager->adc_channel_count[unit]--;
      if (manager->adc_channel_count[unit] == 0 && manager->adc_unit_handles[unit]) {
        adc_oneshot_del_unit(manager->adc_unit_handles[unit]);
        manager->adc_unit_handles[unit] = NULL;
      }
      config->proto.adc.unit_handle = NULL;
      goto fail;
    }

    default:
      ESP_LOGE(s_TAG, "Unsupported bus type for initialization: %d", config->type);
      ret = ESP_ERR_NOT_SUPPORTED;
      goto fail;
  }

  /* Mark as initialized */
  config->initialized = true;
  ESP_LOGI(s_TAG,
           "Successfully initialized bus/device '%s' (%s)",
           bus_name,
           star_bus_type_to_string(config->type));
  return ESP_OK;

/* Failure points with specific cleanup needs */
fail_i2c_driver:
  /* If driver install failed after param_config, no specific cleanup needed for param_config */
  goto fail;

fail_spi_add_device:
  /* If add_device failed, we might need to free the bus if we just initialized it */
  /* This logic is now handled by the manager during remove_bus */
  goto fail;

/* Generic failure point */
fail:
  ESP_LOGE(s_TAG, "Failed to initialize bus/device '%s'", bus_name);
  return ret;
}

esp_err_t star_bus_config_deinit(star_bus_config_t* config)
{
  ESP_RETURN_ON_FALSE(config, ESP_ERR_INVALID_ARG, s_TAG, "Config pointer is NULL");
  ESP_RETURN_ON_FALSE(config->initialized,
                      ESP_ERR_INVALID_STATE,
                      s_TAG,
                      "Bus/device '%s' is not initialized",
                      config->name ? config->name : "UNKNOWN");

  esp_err_t   ret      = ESP_OK;
  const char* bus_name = config->name ? config->name : "UNKNOWN";

  switch (config->type) {
    case k_star_bus_type_i2c:
      /* Deinitialize I2C bus */
      ESP_LOGI(s_TAG, "Deinitializing I2C bus '%s' (Port %d)", bus_name, config->proto.i2c.port);

      ret = i2c_driver_delete(config->proto.i2c.port);
      break;

    case k_star_bus_type_spi:
      if (config->proto.spi.is_peripheral) {
        /* SPI Peripheral Mode - Free the peripheral driver */
        ESP_LOGI(s_TAG,
                 "Deinitializing SPI peripheral '%s' (Host %d)",
                 bus_name,
                 config->proto.spi.host);
        ret = spi_slave_free(config->proto.spi.host);
      } else {
        /* SPI Controller Mode - Remove device */
        ESP_LOGI(s_TAG,
                 "Deinitializing SPI device '%s' (Host %d)",
                 bus_name,
                 config->proto.spi.host);
        if (config->handle) {
          ret            = spi_bus_remove_device((spi_device_handle_t)config->handle);
          config->handle = NULL;
        } else {
          ESP_LOGW(s_TAG, "SPI device '%s' handle was already NULL before deinit.", bus_name);
          ret = ESP_OK;
        }
      }
      break;

    case k_star_bus_type_gpio:
      /* GPIO pins don't need explicit deinitialization - they can be reconfigured anytime */
      ESP_LOGI(s_TAG, "Deinitializing GPIO bus '%s'", bus_name);
      ret = ESP_OK;
      break;

    case k_star_bus_type_adc:
      /* Deinitialize ADC channel */
      ESP_LOGI(s_TAG, "Deinitializing ADC bus '%s'", bus_name);

      /* Delete calibration if it was initialized */
      if (config->proto.adc.cali_handle) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
        ret = adc_cali_delete_scheme_curve_fitting(config->proto.adc.cali_handle);
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
        ret = adc_cali_delete_scheme_line_fitting(config->proto.adc.cali_handle);
#endif
        if (ret != ESP_OK) {
          ESP_LOGW(s_TAG,
                   "Failed to delete ADC calibration for '%s': %s",
                   bus_name,
                   esp_err_to_name(ret));
        }
        config->proto.adc.cali_handle = NULL;
      }

